package lesson_3;

import java.util.Scanner;

public class Application {
    public static void main(String[] args) {

        /**
         Операторы сравнения

         == Проверяет, равны или нет значения двух операндов, если да,
         то условие становится истинным (A == B) – не верны

         != Проверяет, равны или нет значения двух операндов,
         если значения не равны, то условие становится истинным (A != B) – значение истинна

         > Проверяет, является ли значение левого операнда больше,
         чем значение правого операнда, если да, то условие становится истинным (A > B) – не верны

         < Проверяет, является ли значение левого операнда меньше,
         чем значение правого операнда, если да, то условие становится истинным (A < B) – значение истинна

         >= Проверяет, является ли значение левого операнда больше или равно значению правого операнда,
         если да, то условие становится истинным (A >= B) – значение не верны

         <= Проверяет, если значение левого операнда меньше или равно значению правого операнда,
         если да, то условие становится истинным (A <= B) – значение истинна
         * */

        /**Логические операторы

         && Называется логический оператор «И». Если оба операнда являются не равны нулю, то условие становится истинным
         || Называется логический оператор «ИЛИ». Если любой из двух операндов не равен нулю, то условие становится истинным
         ! Называется логический оператор «НЕ». Использование меняет логическое состояние своего операнда.
         Если условие имеет значение true, то оператор логического «НЕ» будет делать false
         */

        int rate = 6;

        if (rate == 5) {
            System.out.println("Отлично");
        } else if (rate == 4) {
            System.out.println("Хорошо");
        } else if (rate == 3) {
            System.out.println("Удо");
        } else if (rate == 2) {
            System.out.println("Плохо");
        } else if (rate == 1) {
            System.out.println("Отвратительно");
        } else {
            System.out.println("Оценка неизвестна");
        }
        System.out.println("-------------------------------------------------");

        int s = 100;

        if ((s < 100) && (s > 50)) {
            System.out.println("Это число попадает в наш диапозон");
        } else {
            System.out.println("Это число не попадает в наш диапозон ");
        }
        System.out.println("-------------------------------------------------");
        //int week = 6;
        Scanner scan = new Scanner(System.in);
        int week = scan.nextInt();

        switch (week) {
            case (1):
                System.out.println("Сегодня понедельник");
                break;
            case (2):
                System.out.println("Сегодня вторник");
                break;
            case (3):
                System.out.println("Сегодня среда");
                break;
            case (4):
                System.out.println("Сегодня четверг");
                break;
            case (5):
                System.out.println("Сегодня пятница");
                break;
            case (6):
                System.out.println("Сегодня суббота");
                break;
            case (7):
                System.out.println("Сегодня воскресенье");
                break;
            default:
                System.out.println("Сегодня не известный день");
                break;
        }
        System.out.println("-------------------------------------------------");


    }

}
